Revit 2024 API
RoutingPreferenceRule.Description Property
 The description of the routing preference rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string Description { get; }
Visual Basic
Public ReadOnly Property Description As String
	Get
Visual C++
public:
property String^ Description {
	String^ get ();
}
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace